// pages/rules/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    ruleList: [
      {
        title: '活动介绍',
        content: '全国校园安全大赛由中国教师发展基金会与中国人寿保险股份有限责任公司联合主办，是为加强各校安全管理、安全防范、安全救护等方面的能力，进一步提高广大师生及社会各届安全责任意识，普及安全知识。安全救护等方面的能力，进一步提高广大师生。'
      },
      {
        title: '活动须知',
        content:`1． 本网站成员可以报名参加活动
2． 报名要及时，在同一个时间段只允许报一项活动
3.　人的生命是最宝贵的。为了爱你的人和你爱的人，请珍惜自己的生命，不要参加可能威胁人身安全的活动
４． 守信用，按时参加活动`
      },
      {
        title: '礼物说明',
        content: `1． 本网站成员可以报名参加活动
2． 报名要及时，在同一个时间段只允许报一项活动
3.　人的生命是最宝贵的。为了爱你的人和你爱的人，请珍惜自己的生命，不要参加可能威胁人身安全的活动
４． 守信用，按时参加活动`
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})